package java_basics;

public class PrimitiveDataTypes {
    // main - это главный метод. Через него всё проходит и запускается. Хочешь написать программу - нужен всегда main метод.

    // Для начала надо понять какие тебе в этом языке программирования даны типы данных,
    // с которыми ты можешь работать.

    // Посмотри это видео:
    // https://youtu.be/cOt_Gulu2mE?si=F-yNi7VA_ZRHnJmi

    // выпиши в System.out.println -ах все примитивные типы данных, которые есть в Java. Как пример, вот байт
    // ЗАДАЧА:
    // В одной строке задекларируй и проинициализируй тип данных
    // Во второй строке добавь её в новый System.out.println

    public static void main(String[] args) {
        byte myByte = 100;
        System.out.println(myByte);



    }



}




